DataProcessors/ПомощникОплатыПатента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ПомощникОплатыПатента</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ВидыУведомленийОСпецрежимахНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыУведомленийОСпецрежимахНалогообложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПереходеНаУСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОбУтратеПраваНаУСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОбОтказеОтУСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОбИзмененииОбъектаНалогообложенияПоУСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПрекращенииДеятельностиПоУСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявлениеНаПолучениеПатента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявлениеНаПолучениеПатентаРекомендованнаяФорма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявлениеОбУтратеПраваНаПатент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявлениеОПрекращенииДеятельностиПоПатентнойСистеме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормаЕНВД1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормаЕНВД2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормаЕНВД3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормаЕНВД4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормаС09_1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормаС09_2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормаС09_3_1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормаС09_3_2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормаС09_4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Форма_1_6_Учет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормаУ_ИО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормаТС1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормаТС2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормаС09_6</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявлениеИсключенииПроверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявлениеПостановкаОбъектаНВОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормаР21001</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормаР24001</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормаР11001</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормаР13001</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормаР13014</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормаР14001</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормаКИК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеОНаделенииОППолномочиямиПоВыплатам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормаСИО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НевозможностьПредоставленияДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявлениеОВозвратеНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявлениеОЗачетеНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДекларацияОХарактеристикахОбъектаНедвижимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявлениеОПредоставленииРассрочкиФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявлениеОПримененииНалоговойЛьготыУчастникамиРегиональныхИнвестиционныхПроектов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПостановкаСнятиеВКачествеНалоговогоАгента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласиеНаРаскрытиеНалоговойТайны</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеУчастникаСколково</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявлениеНаПолучениеДокументаНалоговогоРезидента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеУменьшениеНалогаККТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявлениеОсвобождениеОтСтраховыхВзносов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОбОткрытииЗакрытииСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОбИзмененииРеквизитовСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОНаличииСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеПорядокПредставленияНалоговыхДеклараций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеРанееПредставленныеДокументы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеНДДДУС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявлениеНДДДУС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеКЛМК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеПрекращениеЕСХН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсвобождениеОтНДСПриЕСХН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеРегиональныхНалогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсвобождениеОтУплатыНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОсвобождениеНалогНаПрибыльСколково</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОсвобождениеНДССколково</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросСведенийСоставляющихНалоговуюТайну</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСуммыНВОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачетСуммыНВОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявлениеЛьготаТранспортЗемля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявлениеНаПриемДокументовФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уведомление1НачалоУплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уведомление2ОтказОтУплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетДДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереходНаЕСХН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыборНалоговогоОрганаНДФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеПереходНПДЕСХН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеПереходНПДУСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеПорядокУплатыПрибыль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявлениеОГибелиТранспортногоСредства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявлениеОПредоставленииРассрочкиПоНалоговымПлатежам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеПорядкаИсчисленияАвансовПоНалогуНаПрибыль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявлениеНаСубсидиюДляЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СубсидияНаПроведениеПрофилактики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласиеНаИнформированиеОЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖалобаФНС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявлениеОПроведенииНалоговогоМониторинга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформацияОбОрганизацииСистемыВнутреннегоКонтроля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеТранспортЗемля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформацияОбУчастниках</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчетнаяПолитика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегламентИнформационногоВзаимодействия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаСправкиПоРасчетам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СверкаРасчетовПоНалогам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеестрДокументовПодтверждающихЛьготы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УменьшениеНалогаНаСтраховыеВзносы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаСообщенийОСуммахНалогов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УведомлениеОСпецрежимахНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>УведомлениеОСпецрежимахНалогообложения</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУведомления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУведомленийОСпецрежимахНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеУведомления</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияВИФНС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантПризнак</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантФамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантОтчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантДокумент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ПомощникОплатыПатента/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем ПараметрыОбработчикаОжиданияАктуализации;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЦветПодсветки = ЦветаСтиля.БыстрыеОтборыФонГруппы;
	
	Организация   = Параметры.Организация;
	Патент        = Параметры.Патент;
	ПериодСобытия = Параметры.ПериодСобытия;
	Срок          = Параметры.Срок;
	
	Если НЕ ЗначениеЗаполнено(Патент)
		И НЕ Справочники.Патенты.ИспользуетсяНесколькоПатентов(Организация, ПериодСобытия) Тогда
		Патент = УчетПСН.ПатентПоУмолчанию(Организация, ПериодСобытия);
	КонецЕсли;
	
	ЕстьПравоСозданияДокументов = ПравоДоступа("Изменение", Метаданные.Документы.ПлатежноеПоручение)
		И ПравоДоступа("Изменение", Метаданные.Документы.РасходныйКассовыйОрдер);
	ЕстьПравоАктуализироватьДанные = ПравоДоступа("Изменение", Метаданные.Документы.РегламентнаяОперация);
	ЕстьПравоСозданияУведомления = ПравоДоступа("Изменение", Метаданные.Документы.УведомлениеОСпецрежимахНалогообложения);
	ДанныеУчетаАктуальны = Истина;
	ТребуетсяПроверятьАктуальность = Истина;
	ВозможнаБыстраяАктуализация = Истина;
	
	НастроитьБаннерАнтикризис();
	
	ЗаполнитьПоказателиРассчитатьНалог();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПередНачаломДлительнойОперации();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеПатента" Тогда
		
		// Изменены реквизиты патента.
		
		Если ТипЗнч(Параметр) = Тип("Структура")
			И Параметр.Свойство("Ссылка") И Параметр.Ссылка = Патент Тогда
			
			ЗаполнитьПоказателиРассчитатьНалог();
			
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "Запись_ПлатежныйДокумент_УплатаНалогов" Тогда
		
		// Записан документ ПлатежноеПоручение или РасходныйКассовыйОрдер с видом операции "Уплата налога".
		
		Если ТипЗнч(Параметр) = Тип("Структура")
			И Параметр.Свойство("Организация") И Параметр.Организация = Организация
			И Параметр.КБК = КБК Тогда
			
			ОбработатьЗаписьДокументаНаУплатуНалога();
			
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "Запись_РасходыНаКассовуюТехнику" Тогда
		
		ЗаполнитьРасходыРассчитатьНалог();
	
	ИначеЕсли ИмяСобытия = "Запись_РасходыНаОнлайнКассыУменьшающиеНалогПСН"
		И Параметр = РегистрацияВНалоговомОргане Тогда
		
		ЗаполнитьРасходыРассчитатьНалог();
		
	ИначеЕсли ИмяСобытия = "ИзменениеВыписки" Тогда
		
		ОбработатьЗаписьДокументаНаУплатуНалога();
		
	ИначеЕсли ИмяСобытия = "Запись_УведомлениеОСпецрежимахНалогообложения" Тогда
		
		Если ТипЗнч(Параметр) = Тип("Структура")
			И ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметр, "Организация", Неопределено) = Организация 
			И ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметр, "РегистрацияВИФНС", Неопределено) = РегистрацияВНалоговомОргане Тогда
			ВидУведомления = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметр, "ВидУведомления", Неопределено);
			Если ВидУведомления = ПредопределенноеЗначение(
					"Перечисление.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеУменьшениеНалогаККТ") Тогда
				ЗаполнитьПоказателиУведомления();
				УправлениеФормой(ЭтотОбъект);
			ИначеЕсли ВидУведомления = ПредопределенноеЗначение(
					"Перечисление.ВидыУведомленийОСпецрежимахНалогообложения.УменьшениеНалогаНаСтраховыеВзносы") Тогда
				ТребуетсяОбновитьПоказатели = Ложь;
				Для Каждого Строка Из Уведомления Цикл
					Если Строка.Ссылка = Источник Тогда
						ТребуетсяОбновитьПоказатели = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если ТребуетсяОбновитьПоказатели Тогда
					ЗаполнитьПоказателиРассчитатьНалог();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	
	ИначеЕсли ИмяСобытия = "Запись_НастройкиПродленияСроковНалоговОтчетов" И Параметр.Организация = Организация Тогда
		
		ЗаполнитьПоказателиРассчитатьНалог();
		
	ИначеЕсли ИмяСобытия = УчетПСНКлиентСервер.ИмяСобытияЗаписиУменьшенияНалогаПСННаСтраховыеВзносы()
		И ТипЗнч(Параметр) = Тип("Структура")
		И ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметр, "Организация", Неопределено) = Организация
		И ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметр, "Патент", Неопределено) = Патент Тогда
		
		ЗаполнитьПоказателиРассчитатьНалог();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ЗначениеЗаполнено(Организация)
		И ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(Организация) Тогда
		
		ТекстСообщения = НСтр("ru = 'Организации - юридические лица не могут применять патентную систему налогообложения'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Организация", , Отказ);
		
		МассивНепроверяемыхРеквизитов.Добавить("Организация");
		
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ОтключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеАктуализации");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТекстБаннераОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "Антикризис" Тогда
		
		СтандартнаяОбработка = Ложь;
		НастройкиУчетаКлиент.ОткрытьНастройкиАнтикризис(Организация);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаЗакрытьБаннерНажатие(Элемент)
	
	ВидимостьБаннераАнтикризис = Ложь;
	
	СкрытьБаннерАнтикризис(Организация);
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПлатежОбработкаНавигационнойСсылки(Элемент, ТекстСсылки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыПлатежныхДокументов = ПомощникиПоУплатеНалоговИВзносовКлиент.ПараметрыОбработкиСпискаДокументов(
		Платежи, "Платеж", ОповещениеУдаленияПлатежногоДокумента());
	
	ПомощникиПоУплатеНалоговИВзносовКлиент.ОбработкаНавигационнойСсылкиДокумента(Элемент,
		ТекстСсылки, ПараметрыПлатежныхДокументов);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УведомлениеУменьшениеСтраховыеВзносыОбработкаНавигационнойСсылки(Элемент, ТекстСсылки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыУведомлений = ПомощникиПоУплатеНалоговИВзносовКлиент.ПараметрыОбработкиСпискаДокументов(
		Уведомления, "УведомлениеУменьшениеСтраховыеВзносы", ОповещениеУдаленияУведомления());
	
	ПомощникиПоУплатеНалоговИВзносовКлиент.ОбработкаНавигационнойСсылкиДокумента(Элемент,
		ТекстСсылки, ПараметрыУведомлений);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеИФНСНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПоказатьЗначение(, РегистрацияВНалоговомОргане);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьРасходыНаОнлайнКассыОбработкаНавигационнойСсылки(Элемент, ТекстСсылки, СтандартнаяОбработка)
	
	Если ТекстСсылки = "ДобавитьРасходыНаККТ" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("УменьшаемыйНалог",
			ПредопределенноеЗначение("Перечисление.ВидыНалоговУменьшаемыхНаРасходыККТ.Патент"));
		ЗначенияЗаполнения.Вставить("Организация", Организация);
		ЗначенияЗаполнения.Вставить("РегистрацияВНалоговомОргане", РегистрацияВНалоговомОргане);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
		ПараметрыФормы.Вставить("ВызовИзПомощника",   Истина);
		
		ОткрытьФорму("Документ.РасходыНаОнлайнКассыУменьшающиеНалоги.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыНаОнлайнКассыВсегоНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьСписокРасходыНаОнлайнКассы();
	
КонецПроцедуры

&НаКлиенте
Процедура НалоговыйВычетДругиеПатентыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьРаспределениеРасходовНаОнлайнКассы();
	
КонецПроцедуры

&НаКлиенте
Процедура УведомлениеПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПоказатьЗначение(, Уведомление);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОплатитьСБанковскогоСчета(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьДокументУплатыНалога(ПредопределенноеЗначение("Перечисление.СпособыУплатыНалогов.БанковскийПеревод"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатитьНаличнымиПоКвитанции(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьДокументУплатыНалога(ПредопределенноеЗначение("Перечисление.СпособыУплатыНалогов.НаличнымиПоКвитанции"));
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьУведомление(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗаполнения = УчетПСНВызовСервера.ДанныеЗаполненияУведомленияОбУменьшенииНалога(
		Организация,
		РегистрацияВНалоговомОргане);
	
	// Если есть уведомление, созданное сегодня - перезаполним существующее, иначе создадим новое.
	Если ЗначениеЗаполнено(Уведомление) И НачалоДня(УведомлениеДата) = НачалоДня(ТекущаяДата()) Тогда
		ДанныеЗаполнения.Вставить("Ссылка", Уведомление);
	КонецЕсли;
	
	УведомлениеОСпецрежимахНалогообложенияКлиент.ОткрытьИЗаполнитьФормуУведомленияККТ(ДанныеЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьУведомлениеУменьшениеНаСтраховыеВзносы(Команда)
	
	ДанныеПомощника = ДанныеПомощникаДляУведомленияОбУменьшенииНалогаНаСтраховыеВзносы();
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ДанныеПомощника", ДанныеПомощника);
	ОповещениеЗакрытияУведомления = Новый ОписаниеОповещения("СозданиеУведомленияОкончание", ЭтотОбъект);

	ОткрытьФорму(
		ДанныеПомощника.ПутьКФорме, ПараметрыОткрытия, , , , , ОповещениеЗакрытияУведомления);
	
КонецПроцедуры

&НаКлиенте
Процедура Актуализировать(Команда)
	
	АктуализироватьДанные();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ДанныеПомощникаДляУведомленияОбУменьшенииНалогаНаСтраховыеВзносы()
	
	ДанныеПомощника = НовыеДанныеПомощника();
	ДанныеПомощника.Организация = Организация;
	ДанныеПомощника.РегистрацияВИФНС = РегистрацияВНалоговомОргане;
	ДанныеПомощника.ПутьКФорме = УчетПСН.ПутьКФормеУведомленияУменьшенияНалогаПСН();
	ДанныеПомощника.ДанныеЗаполнения = УчетПСН.ДанныеЗаполненияУведомленияОбУменьшенииНалогаНаСтраховыеВзносы(
		Патент, ОстатокРасходыСтраховыеВзносы, УникальныйИдентификатор);
	
	Возврат ДанныеПомощника;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПоказателиРассчитатьНалог()
	
	Если Не ЗначениеЗаполнено(Патент) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДанныеПатента();
	
	ЗаполнитьРасходыУменьшающиеНалог();
	
	ЗаполнитьПоказателиУведомления();
	
	НайтиИОтобразитьДокументыОплаты();
	
	РасчетСуммыКУплате();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасходыРассчитатьНалог()
	
	ЗаполнитьРасходыУменьшающиеНалог();
	
	ЗаполнитьПоказателиУведомления();
	
	НайтиИОтобразитьДокументыОплаты();
	
	РасчетСуммыКУплате();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПатента()
	
	Показатели = Обработки.ПомощникОплатыПатента.ПоказателиПатента(Патент, Срок);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Показатели);
	
	УстановитьФункциональныеОпцииФормы();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасходыУменьшающиеНалог()
	
	Уведомления.Очистить();
	
	Если ПрименяетсяВычетПоОнлайнКассам Тогда
		ПоказателиРасходовККМ = Обработки.ПомощникОплатыПатента.ПоказателиРасходовККМУменьшающихНалог(Организация,
		РегистрацияВНалоговомОргане, Патент, ВидПлатежа);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПоказателиРасходовККМ);
	КонецЕсли;
	
	Если ПрименяетсяУменьшениеНалогаНаСуммуСтраховыхВзносов Тогда
		ПоказателиРасходовСтраховыеВзносы =
			Обработки.ПомощникОплатыПатента.ПоказателиРасходовСтраховыеВзносы(Организация, Патент, ДатаНачала, ДатаОкончания);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПоказателиРасходовСтраховыеВзносы);
		Для Каждого ДанныеУведомления Из ПоказателиРасходовСтраховыеВзносы.СведенияОбУведомлениях Цикл
			Строка = Уведомления.Добавить();
			ЗаполнитьЗначенияСвойств(Строка, ДанныеУведомления);
		КонецЦикла;
			
		ПомощникиПоУплатеНалоговИВзносов.ОтобразитьДокументы(
			ЭтотОбъект, Уведомления, "УведомлениеУменьшениеСтраховыеВзносы");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказателиУведомления()
	
	Если НЕ ПрименяетсяВычетПоОнлайнКассам Тогда
		Возврат;
	КонецЕсли;
	
	ПоказателиУведомления = Обработки.ПомощникОплатыПатента.ПоказателиУведомления(
		Организация, РегистрацияВНалоговомОргане, Патент, Срок);
	
	Если ПоказателиУведомления.ЕстьУведомление Тогда
		
		Уведомление = ПоказателиУведомления.Уведомление;
		УведомлениеПредставление = ПоказателиУведомления.УведомлениеПредставление;
		УведомлениеДата = ПоказателиУведомления.УведомлениеДата;
		
		УведомлениеАктуально = ПоказателиУведомленияСоответствуютПомощнику(ПоказателиУведомления);
		
	Иначе
		
		Уведомление = Документы.УведомлениеОСпецрежимахНалогообложения.ПустаяСсылка();
		УведомлениеПредставление = "";
		УведомлениеДата = '00010101';
		УведомлениеАктуально = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПоказателиУведомленияСоответствуютПомощнику(ПоказателиУведомления)
	
	СравниваемыеПоказатели = Обработки.ПомощникОплатыПатента.СравниваемыеПоказателиУведомления();
	
	Для Каждого ИмяПоказателя Из СравниваемыеПоказатели Цикл
		
		Если ПоказателиУведомления[ИмяПоказателя] <> ЭтотОбъект[ИмяПоказателя] Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура НайтиИОтобразитьДокументыОплаты()
	
	ДокументыУплаты = Обработки.ПомощникОплатыПатента.ДокументыУплатыПатента(
		Организация,
		Патент,
		ПериодСобытия,
		ВидНалога);
	
	Платежи.Загрузить(ДокументыУплаты);
	
	ПомощникиПоУплатеНалоговИВзносов.ОтобразитьПлатежи(ЭтотОбъект, Платежи, "Платеж");
	
КонецПроцедуры

&НаСервере
Процедура РасчетСуммыКУплате()
	
	Уплачено = Платежи.Итог("Сумма");
	
	НалогИсчисленный = НалогПоПатенту - УменьшениеСтраховыеВзносыТекущийПатент - СуммаОсвобожденияОтНалога;
	СуммаНалога = Макс(НалогИсчисленный - Уплачено, 0);
	СуммаКУплате = Макс(СуммаНалога - НалоговыйВычетТекущийПлатеж, 0);
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#Область ОбработкаСобытийСпискаПлатежей

&НаКлиенте
Функция ОповещениеУдаленияПлатежногоДокумента()
	Возврат Новый ОписаниеОповещения("УдалитьДокументУплатыНаКлиентеЗавершение", ЭтотОбъект);
КонецФункции

&НаКлиенте
Функция ОповещениеУдаленияУведомления()
	Возврат Новый ОписаниеОповещения("УдалитьУведомлениеЗавершение", ЭтотОбъект);
КонецФункции

&НаКлиенте
Процедура УдалитьДокументУплатыНаКлиентеЗавершение(ДокументУплатыДляУдаления, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ДокументУплатыДляУдаления) Тогда
		УдалитьДокументУплаты(ДокументУплатыДляУдаления);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьУведомлениеЗавершение(СсылкаНаУдаление, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(СсылкаНаУдаление) Тогда
		УдалитьУведомление(СсылкаНаУдаление);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДокументУплаты(ДокументУплатыДляУдаления)
	
	ДокументУплатыОбъект = ДокументУплатыДляУдаления.ПолучитьОбъект();
	ДокументУплатыОбъект.УстановитьПометкуУдаления(Истина);
	
	НайтиИОтобразитьДокументыОплаты();
	
	РасчетСуммыКУплате();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьУведомление(СсылкаНаУдаление)
	
	УведомлениеОбъект = СсылкаНаУдаление.ПолучитьОбъект();
	УведомлениеОбъект.УстановитьПометкуУдаления(Истина);
	ЗаполнитьПоказателиРассчитатьНалог();
	
КонецПроцедуры

#КонецОбласти

#Область БаннерАнтикризис

&НаСервере
Процедура НастроитьБаннерАнтикризис()
	
	ВидимостьБаннераАнтикризис = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"ВидимостьБаннераАнтикризисНастройкиНалоговИОтчетов",
		КлючНастройкиБаннераАнтикризис(Организация),
		Истина);
	
	ТекстБаннера = НалоговыйУчет.ТекстБаннераНастройкиНалоговИОтчетов(Организация,
		ЗадачиБухгалтераКлиентСервер.КодЗадачиПатент());
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КлючНастройкиБаннераАнтикризис(Знач Организация)
	
	КодЗадачи = ЗадачиБухгалтераКлиентСервер.КодЗадачиПатент();
	
	Возврат НалоговыйУчет.КлючНастройкиБаннераАнтикризис(Организация, КодЗадачи);
	
КонецФункции

&НаСервереБезКонтекста
Процедура СкрытьБаннерАнтикризис(Знач Организация)
	
	НалоговыйУчет.СохранитьНастройкуБаннераАнтикризис(Организация,
		ЗадачиБухгалтераКлиентСервер.КодЗадачиПатент(),
		Ложь);
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ОбработатьЗаписьДокументаНаУплатуНалога()
	
	НайтиИОтобразитьДокументыОплаты();
	РасчетСуммыКУплате();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументУплатыНалога(СпособУплаты)
	
	ОписаниеДействияПлатеж = ОписаниеДействияДляНовогоДокументаУплатыНалога(Организация, Патент,
		СуммаКУплате, СпособУплаты, ПериодСобытия);
	
	Если ОписаниеДействияПлатеж <> Неопределено Тогда
		ВыполнениеЗадачБухгалтераКлиент.ВыполнитьДействие(ОписаниеДействияПлатеж);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОписаниеДействияДляНовогоДокументаУплатыНалога(Организация, Патент, Сумма, СпособУплаты, ПериодСобытия)
	
	Возврат ВыполнениеЗадачБухгалтера.ОписаниеДействияПлатежПоПатенту(Организация, Патент, Сумма, СпособУплаты, ПериодСобытия);
	
КонецФункции

&НаСервере
Процедура УстановитьФункциональныеОпцииФормы()
	
	ПрименяетсяВычетПоОнлайнКассам = УчетПСН.ПрименяетсяВычетПоОнлайнКассам(Организация, ПериодСобытия);
	
	ПрименяетсяОсвобождениеОтНалога
		= УчетПСНКлиентСервер.ПрименяетсяОсвобождениеОтНалога(Организация, ДатаНачала, ДатаОкончания);
	
	ПрименяетсяУменьшениеНалогаНаСуммуСтраховыхВзносов =
		ДатаНачала >= УчетПСНКлиентСервер.ДатаНачалаУменьшенияПСННаСтраховыеВзносы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокРасходыНаОнлайнКассы()
	
	Отбор = Новый Структура;
	Отбор.Вставить("УменьшаемыйНалог",
		ПредопределенноеЗначение("Перечисление.ВидыНалоговУменьшаемыхНаРасходыККТ.Патент"));
	Отбор.Вставить("Организация", Организация);
	Отбор.Вставить("РегистрацияВНалоговомОргане", РегистрацияВНалоговомОргане);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ПараметрыФормы.Вставить("УменьшаемыйНалог",
		ПредопределенноеЗначение("Перечисление.ВидыНалоговУменьшаемыхНаРасходыККТ.Патент"));
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("НалоговыйПериод", ДатаОкончания);
	ПараметрыФормы.Вставить("РегистрацияВНалоговомОргане", РегистрацияВНалоговомОргане);
	
	ОткрытьФорму("Документ.РасходыНаОнлайнКассыУменьшающиеНалоги.Форма.ФормаСписокРасходов", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРаспределениеРасходовНаОнлайнКассы()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("РегистрацияВНалоговомОргане", РегистрацияВНалоговомОргане);
	ПараметрыФормы.Вставить("ТекущийПатент", Патент);
	ПараметрыФормы.Вставить("РасходыНаОнлайнКассыВсего", РасходыНаОнлайнКассыВсего);
	ПараметрыФормы.Вставить("НалоговыйВычетТекущийПатент", НалоговыйВычетТекущийПатент);
	
	ОткрытьФорму("Обработка.ПомощникОплатыПатента.Форма.РаспределениеВычетаПоПатентам", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	ОформитьОсвобождениеОтНалога(Форма);
	
	ОформитьТекущийПлатеж(Форма);
	
	ОформитьРасходыНаОнлайнКассыВсего(Форма);
	
	ОформитьРасходыСтраховыеВзносы(Форма);
	
	ОформитьНалоговыйВычет(Форма);
	
	ОформитьУведомление(Форма);
	
	ОформитьКомандыФормы(Форма);
	
	ОформитьСуммуКУплате(Форма);
	
	ОформитьАктуализацию(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОформитьАктуализацию(Форма)
	
	Элементы = Форма.Элементы;
	ВыполняетсяФоновоеЗадание = ВыполняетсяФоновоеЗадание(Форма);
	
	Элементы.ГруппаКомандыУплаты.Видимость = Не ВыполняетсяФоновоеЗадание И Форма.ДанныеУчетаАктуальны;
	Элементы.ГруппаРасчетПлатежа.Видимость = Не ВыполняетсяФоновоеЗадание И Форма.ДанныеУчетаАктуальны;
	Элементы.ГруппаАктуализироватьДанныеУчета.Видимость = Не Форма.ДанныеУчетаАктуальны
		И Не Форма.ВозможнаБыстраяАктуализация
		И Не ВыполняетсяФоновоеЗадание;
	Элементы.ГруппаАктуализироватьДанныеУчета.ЦветФона = Форма.ЦветПодсветки;
	Элементы.АктуализироватьДанныеУчета.Доступность = Форма.ЕстьПравоАктуализироватьДанные;
	Элементы.ГруппаСтатусФоновогоЗадания.Видимость = ВыполняетсяФоновоеЗадание;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОформитьОсвобождениеОтНалога(Форма)
	
	Элементы = Форма.Элементы;
	
	// Баннер
	ВозможноОсвобождениеОтНалога = УчетПСНКлиентСервер.ВозможноОсвобождениеОтНалога(Форма.ДатаНачала, Форма.ДатаОкончания);
	
	Элементы.ТекстБаннера.Видимость = ВозможноОсвобождениеОтНалога И Форма.ВидимостьБаннераАнтикризис;
	Элементы.КартинкаЗакрытьБаннер.Видимость = ВозможноОсвобождениеОтНалога И Форма.ВидимостьБаннераАнтикризис;
	
	// Освобождение от налога
	Элементы.ГруппаОсвобождениеОтНалога.Видимость = Форма.ПрименяетсяОсвобождениеОтНалога;
	Элементы.ГруппаНалогПоПатентуКУплате.Видимость = Форма.ПрименяетсяОсвобождениеОтНалога;
	
	Элементы.ОсвобождениеОтНалогаРасширеннаяПодсказка.Заголовок = УчетПСНКлиентСервер.ТекстПодсказкиОсвобождениеОтНалога(
		Форма.ПрименяетсяОсвобождениеОтНалога,
		Форма.СуммаОсвобожденияОтНалога,
		Форма.ПотенциальноВозможныйГодовойДоход,
		Форма.ДатаНачала,
		Форма.ДатаОкончания);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОформитьТекущийПлатеж(Форма)
	
	Элементы = Форма.Элементы;
	ВыполняетсяФоновоеЗадание = ВыполняетсяФоновоеЗадание(Форма);
	
	Элементы.ГруппаПредыдущийПлатеж.Видимость = Форма.ПредыдущийПлатеж > 0;
	
	Элементы.НадписьТекущийПлатеж.Заголовок    = Форма.ТекущийПлатежОписание;
	Элементы.НадписьПредыдущийПлатеж.Заголовок = Форма.ПредыдущийПлатежОписание;
	
	Элементы.СуммаНалога.Видимость          = Форма.ПрименяетсяВычетПоОнлайнКассам;
	Элементы.СуммаНалогаБезВычета.Видимость = НЕ Форма.ПрименяетсяВычетПоОнлайнКассам;
	
	Элементы.ГруппаРасходыНаОнлайнКассы.Видимость = Форма.ПрименяетсяВычетПоОнлайнКассам И
		Не ВыполняетсяФоновоеЗадание И Форма.ДанныеУчетаАктуальны;
	Элементы.ГруппаОплатаНалога.Видимость = Форма.ПрименяетсяВычетПоОнлайнКассам И
		Не ВыполняетсяФоновоеЗадание И Форма.ДанныеУчетаАктуальны;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОформитьРасходыНаОнлайнКассыВсего(Форма)
	
	Если НЕ Форма.ПрименяетсяВычетПоОнлайнКассам Тогда
		Возврат;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	
	ФорматСумм = "ЧДЦ=; ЧН=0";
	
	ЭлементыНадписи = Новый Массив;
	
	Если Форма.РасходыНаОнлайнКассыВсего = 0 Тогда
		
		Элементы.РасходыНаОнлайнКассыВсего.Видимость = Ложь;
		Форма.НадписьРасходыНаОнлайнКассы =
			Новый ФорматированнаяСтрока(НСтр("ru = 'Добавить сведения о расходах'"), , , , "ДобавитьРасходыНаККТ");
		
	Иначе
		
		Элементы.РасходыНаОнлайнКассыВсего.Видимость = Истина;
		
		Если Форма.РасходыНаОнлайнКассыКоличествоКасс > 1 Тогда // Одну кассу не показываем.
			ТекстКоличествоКасс = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
				НСтр("ru = ';%1 касса;;%1 кассы;%1 касс;%1 касс'"),
				Форма.РасходыНаОнлайнКассыКоличествоКасс);
			ТекстНадписи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '(%1)'"), ТекстКоличествоКасс);
		Иначе
			ТекстНадписи = "";
		КонецЕсли;
		
		Форма.НадписьРасходыНаОнлайнКассы = Новый ФорматированнаяСтрока(ТекстНадписи);
		Элементы.НадписьРасходыНаОнлайнКассы.Видимость = Не ПустаяСтрока(ТекстНадписи);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОформитьРасходыСтраховыеВзносы(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.ГруппаУменьшениеНалога.Видимость = Форма.ПрименяетсяУменьшениеНалогаНаСуммуСтраховыхВзносов И
		Не ВыполняетсяФоновоеЗадание(Форма) И Форма.ДанныеУчетаАктуальны;
	
	Если Не Форма.ПрименяетсяУменьшениеНалогаНаСуммуСтраховыхВзносов Тогда
		
		Элементы.ГруппаНалогИсчисленный.Видимость = Ложь;
		
		Элементы.НадписьСуммаКУплате.Заголовок = Новый ФорматированнаяСтрока(
			НСтр("ru = 'Налог к уплате:'"), Новый Шрифт(Новый Шрифт, , , Истина));
	Иначе
		Элементы.ГруппаНалогИсчисленный.Видимость = Истина;
		ЗаголовокНалогИсчисленный = Новый Массив;
		ЗаголовокНалогИсчисленный.Добавить(НСтр("ru = 'Налог исчисленный = Налог по патенту - Уменьшение налога'"));
		ЗаголовокНалогИсчисленный.Добавить(Символы.ПС);
		ФормулаНалогИсчисленный = СтрШаблон(НСтр("ru = '(%1 - %2)'"),
			Форма.НалогПоПатенту,
			Форма.УменьшениеСтраховыеВзносыТекущийПатент);
		ЗаголовокНалогИсчисленный.Добавить(ФормулаНалогИсчисленный);
		Элементы.НадписьНалогИсчисленный.Заголовок = СтрСоединить(ЗаголовокНалогИсчисленный);
		
		ЗаголовокНалогКУплате = Новый Массив;
		НачалоЗаголовкаНалогКУплате = Новый ФорматированнаяСтрока(
			НСтр("ru = 'Налог к уплате '"), Новый Шрифт(Новый Шрифт, , , Истина));
		ОкончаниеЗаголовкаНалогКУплате = НСтр("ru = '= Налог исчисленный - Оплачено ранее'");
		ЗаголовокНалогКУплате.Добавить(Новый ФорматированнаяСтрока(
			НачалоЗаголовкаНалогКУплате, ОкончаниеЗаголовкаНалогКУплате, Символы.ПС));
		ФормулаНалогКУплате = СтрШаблон(НСтр("ru = '(%1 - %2)'"),
			Форма.НалогИсчисленный,
			Форма.Уплачено);
		ЗаголовокНалогКУплате.Добавить(ФормулаНалогКУплате);
		Элементы.НадписьСуммаКУплате.Заголовок = Новый ФорматированнаяСтрока(ЗаголовокНалогКУплате);
	КонецЕсли;
	
	Если Форма.ОстатокРасходыСтраховыеВзносы > 0 Тогда
		Элементы.ГруппаУведомлениеУменьшениеНалогаСтраховыеВзносы.Видимость = Истина;
		Элементы.ПояснениеУведомлениеУменьшениеНалогаСтраховыеВзносы.Заголовок = СтрШаблон(
			НСтр("ru = 'Доступно уменьшение налога на сумму %1. Чтобы уменьшить налог сформируйте и подайте уведомление в налоговую инспекцию'"),
			СтрокаСЧислом(НСтр("ru = ';%1 рубль;;%1 рубля;%1 рублей;%1 рубля'"),
			Форма.ОстатокРасходыСтраховыеВзносы, ВидЧисловогоЗначения.Количественное));
	Иначе
		Элементы.ГруппаУведомлениеУменьшениеНалогаСтраховыеВзносы.Видимость = Ложь;
	КонецЕсли;
	
	ОтображатьПодсказкуДляНеСданыхУведомлений = Ложь;
	Для Каждого СведенияУведомление Из Форма.Уведомления Цикл
		Если Не СведенияУведомление.Сдано Тогда
			ОтображатьПодсказкуДляНеСданыхУведомлений = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.НадписьПодсказкаДляНеСданыхУведомлений.Видимость = ОтображатьПодсказкуДляНеСданыхУведомлений;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОформитьНалоговыйВычет(Форма)
	
	Если НЕ Форма.ПрименяетсяВычетПоОнлайнКассам Тогда // Незачем отображать невидимое.
		Возврат;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	
	Элементы.ГруппаУведомление.Видимость = Форма.РасходыНаОнлайнКассыВсего > 0;
	
	ОтображатьРасшифровкуВычета = ТребуетсяОтобразитьРасшифровкуВычета(Форма);
	
	Элементы.НалоговыйВычетТекущийПлатеж.Видимость = ОтображатьРасшифровкуВычета;
	Элементы.ГруппаПоясненияВычета.Видимость       = ОтображатьРасшифровкуВычета;
	
	Элементы.НалоговыйВычетДругиеПатенты.Видимость   = Форма.НалоговыйВычетДругиеПатенты > 0;
	Элементы.НалоговыйВычетСледующийПлатеж.Видимость = Форма.НалоговыйВычетСледующийПлатеж > 0;
	Элементы.НалоговыйВычетОстаток.Видимость         = Форма.НалоговыйВычетОстаток > 0;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОформитьУведомление(Форма)
	
	Если НЕ Форма.ПрименяетсяВычетПоОнлайнКассам Тогда // Незачем отображать невидимое.
		Возврат;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	
	ОтображатьУведомление            = Форма.РасходыНаОнлайнКассыВсего > 0;
	
	Элементы.ГруппаУведомление.Видимость = ОтображатьУведомление;
	
	Элементы.СформироватьУведомление.Видимость  = НЕ Форма.УведомлениеАктуально;
	Элементы.УведомлениеПредставление.Видимость = Форма.УведомлениеАктуально;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОформитьКомандыФормы(Форма)
	
	Элементы = Форма.Элементы;
	
	ТребуетсяУведомление = Форма.ЕстьПравоСозданияУведомления
		И Форма.ПрименяетсяВычетПоОнлайнКассам
		И Форма.РасходыНаОнлайнКассыВсего > 0
		И (НЕ ЗначениеЗаполнено(Форма.Уведомление) ИЛИ НЕ Форма.УведомлениеАктуально);
	
	Элементы.СформироватьУведомление.Доступность = ТребуетсяУведомление;
	
	ТребуетсяУплата = Форма.ЕстьПравоСозданияДокументов И Форма.СуммаКУплате > 0;
	
	Элементы.ОплатитьСБанковскогоСчета.Доступность    = ТребуетсяУплата;
	Элементы.ОплатитьНаличнымиПоКвитанции.Доступность = ТребуетсяУплата;
	
	УведомлениеПоУмолчанию = ТребуетсяУведомление;
	УплатаПоУмолчанию = ТребуетсяУплата И НЕ УведомлениеПоУмолчанию;
	
	Элементы.ГруппаФормированиеУведомления.ЦветФона = ?(УведомлениеПоУмолчанию, Форма.ЦветПодсветки, Новый Цвет);
	Элементы.ГруппаКомандыУплаты.ЦветФона = ?(УплатаПоУмолчанию, Форма.ЦветПодсветки, Новый Цвет);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОформитьСуммуКУплате(Форма)
	
	Элементы = Форма.Элементы;
	
	ЕстьРасшифровкаВычета = ТребуетсяОтобразитьРасшифровкуВычета(Форма);
	
	Элементы.СуммаКУплате.Заголовок = ?(ЕстьРасшифровкаВычета,
		НСтр("ru = 'Текущий платеж с учетом уменьшения'"),
		НСтр("ru = 'Текущий платеж с учетом расходов'"));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ТребуетсяОтобразитьРасшифровкуВычета(Форма)
	
	ТребуетсяРасшифровкаВычета = Форма.НалоговыйВычетДругиеПатенты > 0
		ИЛИ Форма.НалоговыйВычетОстаток > 0
		ИЛИ Форма.НалоговыйВычетСледующийПлатеж > 0;
	
	Возврат ТребуетсяРасшифровкаВычета;
	
КонецФункции

&НаКлиенте
Процедура РасходыНаСтраховыеВзносыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НастройкиОтчета = Новый ПользовательскиеНастройкиКомпоновкиДанных;
	
	НастройкиОтчета.ДополнительныеСвойства.Вставить("Организация", Организация);
	НастройкиОтчета.ДополнительныеСвойства.Вставить("НачалоПериода", НачалоГода(ДатаНачала));
	НастройкиОтчета.ДополнительныеСвойства.Вставить("КонецПериода", КонецГода(ДатаОкончания));
	НастройкиОтчета.ДополнительныеСвойства.Вставить("ПоказательБУ", Истина);
	НастройкиОтчета.ДополнительныеСвойства.Вставить("Налог", "ПСН");
	НастройкиОтчета.ДополнительныеСвойства.Вставить("ВыводитьПодвал", Истина);
	НастройкиОтчета.ДополнительныеСвойства.Вставить("РежимРасшифровкиПомощникОплатыПатента", Истина);
	
	ПараметрыОтчета = Новый Структура();
	
	ПараметрыОтчета.Вставить("ВидРасшифровки", 2);
	ПараметрыОтчета.Вставить("ПользовательскиеНастройки", НастройкиОтчета);
	ПараметрыОтчета.Вставить("СформироватьПриОткрытии", Истина);
	
	ОткрытьФорму("Отчет.СправкаРасчетРасходовУменьшающихОтдельныеНалоги.Форма.ФормаОтчета", ПараметрыОтчета, , Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НовыеДанныеПомощника()
	
	ДанныеПомощника = Новый Структура;
	
	ДанныеПомощника.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	ДанныеПомощника.Вставить("РегистрацияВИФНС", Справочники.РегистрацииВНалоговомОргане.ПустаяСсылка());
	ДанныеПомощника.Вставить("ПутьКФорме", "");
	ДанныеПомощника.Вставить("ДанныеЗаполнения", Новый Структура);
	
	Возврат ДанныеПомощника;
	
КонецФункции

&НаКлиенте
Процедура СозданиеУведомленияОкончание(УведомлениеСсылка, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(УведомлениеСсылка) Тогда
		СоздатьЗаписьУменьшениеНалогаНаСтраховыеВзносы(
			Организация, Патент, УведомлениеСсылка, ОстатокРасходыСтраховыеВзносы);
		
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("Организация", Организация);
		ПараметрыОповещения.Вставить("Патент", Патент);
		Оповестить(УчетПСНКлиентСервер.ИмяСобытияЗаписиУменьшенияНалогаПСННаСтраховыеВзносы(),
			ПараметрыОповещения,
			ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаписьУменьшениеНалогаНаСтраховыеВзносы(Организация, Патент, Уведомление, Сумма)
	
	МенеджерЗаписи = РегистрыСведений.УменьшениеНалогаПСНнаСтраховыеВзносы.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Организация = Организация;
	МенеджерЗаписи.Патент = Патент;
	МенеджерЗаписи.Уведомление = Уведомление;
	МенеджерЗаписи.Сумма = Сумма;
	МенеджерЗаписи.Записать();
	
	ЗаполнитьПоказателиРассчитатьНалог();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВыполняетсяФоновоеЗадание(Форма)
	
	Возврат Форма.ТребуетсяПроверятьАктуальность
		Или ЗначениеЗаполнено(Форма.ИдентификаторЗаданияАктуализации)
		Или ЗначениеЗаполнено(Форма.ИдентификаторЗаданияПроверкиАктуализации);
		
КонецФункции

&НаКлиенте
Процедура ПередНачаломДлительнойОперации()
	
	СтатусФоновогоЗадания = НСтр("ru = 'Выполняется проверка данных...'");
	ВозможнаБыстраяАктуализация = ЕстьПравоАктуализироватьДанные;
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьАктуальностьДанных", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьАктуальностьДанных()
	
	Если Не ТребуетсяПроверятьАктуальность Тогда
		Возврат;
	КонецЕсли;
	
	ЗаданиеАктуализации = ЗакрытиеМесяцаВызовСервера.НайтиФоновоеЗаданиеАктуализацииПоОрганизации(Организация, УникальныйИдентификатор);
	
	Если ЗаданиеАктуализации = Неопределено Или Не ЗначениеЗаполнено(ЗаданиеАктуализации.УникальныйИдентификатор) Тогда
		ПроверитьАктуальностьДанных();
	Иначе
		
		ДанныеУчетаАктуальны = Ложь;
		ВозможнаБыстраяАктуализация = Истина;
		
		Если ИдентификаторЗаданияАктуализации <> ЗаданиеАктуализации.УникальныйИдентификатор Тогда
			// Задание запущено в другой форме
			ЗаданиеЗапущеноВДругойФорме = Истина;
			ИдентификаторЗаданияАктуализации = ЗаданиеАктуализации.УникальныйИдентификатор;
			ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжиданияАктуализации);
			ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеАктуализации",
				ПараметрыОбработчикаОжиданияАктуализации.ТекущийИнтервал, Истина);
		Иначе
			ЗаданиеЗапущеноВДругойФорме = Ложь;
		КонецЕсли;
		
		ОбновитьСтатусФоновогоЗадания();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьАктуальностьДанных()
	
	ОтключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеАктуализации");
	
	ИдентификаторЗаданияАктуализации = Неопределено;
	
	УИДЗамера = ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Ложь, "АктуализацияДанныхТребуетсяАктуализацияЗаПериод");
	
	ПараметрыПроверки = ЗакрытиеМесяцаКлиентСервер.НовыеПараметрыПроверкиАктуальности();
	ПараметрыПроверки.Организация = Организация;
	ПараметрыПроверки.Период = КонецКвартала(ПериодАктуализации());
	ПараметрыПроверки.УникальныйИдентификаторФормы = УникальныйИдентификатор;
	ПараметрыПроверки.УИДЗамера = УИДЗамера;
	ПараметрыПроверки.АктуализироватьВесьПериод = Истина;
	
	РезультатВыполнения = ЗакрытиеМесяцаВызовСервера.ПроверитьАктуальность(ПараметрыПроверки);
	
	ИдентификаторЗаданияПроверкиАктуализации = РезультатВыполнения.ИдентификаторЗадания;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатПроверкиАктуальности", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	
	ОбновитьСтатусФоновогоЗадания();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеАктуализации()
	
	Если ЗакрытиеМесяцаВызовСервера.ЗаданиеВыполнено(ИдентификаторЗаданияАктуализации) Тогда
		ОбработатьРезультатАктуализации();
	Иначе
		ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжиданияАктуализации);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеАктуализации",
			ПараметрыОбработчикаОжиданияАктуализации.ТекущийИнтервал, Истина);
	КонецЕсли;
	
	ОбновитьСтатусФоновогоЗадания();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатПроверкиАктуальности(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		ИдентификаторЗаданияПроверкиАктуализации = Неопределено;
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ИдентификаторЗаданияПроверкиАктуализации = Неопределено;
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	РезультатПроверки = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Если РезультатПроверки.УИДЗамера <> Неопределено Тогда
		ОценкаПроизводительностиКлиент.ЗавершитьЗамерВремени(РезультатПроверки.УИДЗамера);
	КонецЕсли;
	
	ДанныеУчетаАктуальны = Не РезультатПроверки.ТребуетсяАктуализация;
	
	Если ДанныеУчетаАктуальны Тогда
		
		ИдентификаторЗаданияПроверкиАктуализации = Неопределено;
		ТребуетсяПроверятьАктуальность = Ложь;
		УправлениеФормой(ЭтотОбъект);
		
	ИначеЕсли ВозможнаБыстраяАктуализация И Не ЗаданиеЗапущеноВДругойФорме И ЗначениеЗаполнено(Организация)
		И ЗначениеЗаполнено(ПериодСобытия) Тогда
		
		ЗаданиеАктуализации = ЗакрытиеМесяцаВызовСервера.НайтиФоновоеЗаданиеАктуализацииПоОрганизации(Организация, УникальныйИдентификатор);
		Если ЗаданиеАктуализации = Неопределено Или Не ЗначениеЗаполнено(ЗаданиеАктуализации.УникальныйИдентификатор) Тогда
			АктуализироватьДанные();
		Иначе
			
			ДанныеУчетаАктуальны = Ложь;
			
			Если ИдентификаторЗаданияАктуализации <> ЗаданиеАктуализации.УникальныйИдентификатор Тогда
				// Задание запущено в другой форме
				ЗаданиеЗапущеноВДругойФорме = Истина;
				ИдентификаторЗаданияАктуализации = ЗаданиеАктуализации.УникальныйИдентификатор;
				ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжиданияАктуализации);
				ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеАктуализации",
					ПараметрыОбработчикаОжиданияАктуализации.ТекущийИнтервал, Истина);
			Иначе
				ЗаданиеЗапущеноВДругойФорме = Ложь;
			КонецЕсли;
			
			ОбновитьСтатусФоновогоЗадания();
			
		КонецЕсли;
		
	Иначе
		
		ТребуетсяПроверятьАктуальность = Ложь;
		ИдентификаторЗаданияПроверкиАктуализации = Неопределено;
		УправлениеФормой(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктуализироватьДанные()
	
	ОтключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеПроверкиАктуальности");
	ОтключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеАктуализации");
	
	ИдентификаторЗаданияАктуализации = Неопределено;
	
	ПараметрыАктуализации = ЗакрытиеМесяцаКлиентСервер.НовыеПараметрыАктуализации();
	ПараметрыАктуализации.Организация                  = Организация;
	ПараметрыАктуализации.Период                       = КонецКвартала(ПериодАктуализации());
	ПараметрыАктуализации.ИдентификаторЗадания         = ИдентификаторЗаданияАктуализации;
	ПараметрыАктуализации.УникальныйИдентификаторФормы = УникальныйИдентификатор;
	ПараметрыАктуализации.АктуализацияДляРасчетаНалога = ВозможнаБыстраяАктуализация;
	ПараметрыАктуализации.АктуализироватьВесьПериод    = Истина;
	
	РезультатВыполнения = ЗакрытиеМесяцаВызовСервера.АктуализироватьДанные(ПараметрыАктуализации);
	
	АдресХранилищаАктуализации = РезультатВыполнения.АдресХранилища;
	
	Если РезультатВыполнения.ЗаданиеВыполнено Тогда
		ОбработатьРезультатАктуализации();
	Иначе
		ИдентификаторЗаданияАктуализации = РезультатВыполнения.ИдентификаторЗадания;
		ИдентификаторЗаданияПроверкиАктуализации = Неопределено;
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжиданияАктуализации);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеАктуализации",
			ПараметрыОбработчикаОжиданияАктуализации.ТекущийИнтервал, Истина);
		УправлениеФормой(ЭтотОбъект);
	КонецЕсли;
	
	ОбновитьСтатусФоновогоЗадания();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатАктуализации()
	
	ИдентификаторЗаданияПроверкиАктуализации = Неопределено;
	ИдентификаторЗаданияАктуализации = Неопределено;
	
	Если ЗаданиеЗапущеноВДругойФорме Тогда
		
		ПроверитьАктуальностьДанных();
		Возврат;
		
	КонецЕсли;
	
	РезультатАктуализации = ПолучитьИзВременногоХранилища(АдресХранилищаАктуализации);
	
	Если ТипЗнч(РезультатАктуализации) <> Тип("Структура")
	 Или Не РезультатАктуализации.Свойство("Выполнено") Тогда
		ПроведенАнализВариантаАктуализации = Ложь;
		РезультатАктуализации = ЗакрытиеМесяцаКлиентСервер.НовыйРезультатАктуализации();
	Иначе
		ПроведенАнализВариантаАктуализации = ВозможнаБыстраяАктуализация
			И Не РезультатАктуализации.АктуализацияДляРасчетаНалога;
		ВозможнаБыстраяАктуализация = РезультатАктуализации.АктуализацияДляРасчетаНалога;
	КонецЕсли;
	
	ДанныеУчетаАктуальны = РезультатАктуализации.Выполнено;
	ТребуетсяПроверятьАктуальность = Ложь;
	
	Если ДанныеУчетаАктуальны Тогда
		ЗаполнитьПоказателиРассчитатьНалог();
	ИначеЕсли Не ДанныеУчетаАктуальны И Не ПроведенАнализВариантаАктуализации Тогда
		ЗакрытиеМесяцаКлиент.ПоказатьОшибкиАктуализации(ЭтотОбъект,
			РезультатАктуализации,
			НСтр("ru='Расчет налога не выполнен. Обнаружены ошибки.'"));
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Функция ОбновитьСтатусФоновогоЗадания()
	
	Если ЗначениеЗаполнено(ИдентификаторЗаданияАктуализации) Тогда
		
		Прогресс = ЗакрытиеМесяцаВызовСервера.ПрочитатьПрогресс(ИдентификаторЗаданияАктуализации);
		Если ТипЗнч(Прогресс) = Тип("Структура") И Прогресс.Свойство("Процент") Тогда
			ПроцентВыполнения = Формат(Мин(Прогресс.Процент, 99), "ЧЦ=2; ЧДЦ=; ЧВН=; ЧГ=0") + "%";
		ИначеЕсли Прав(СтатусФоновогоЗадания, 1) = "%" Тогда
			ПроцентВыполнения = Прав(СтатусФоновогоЗадания, 3);
		Иначе
			ПроцентВыполнения = "";
		КонецЕсли;
		
		СтатусФоновогоЗадания = СтрШаблон(НСтр("ru = 'Выполняется расчет платежа...%1'"), ПроцентВыполнения);
		
	ИначеЕсли ТребуетсяПроверятьАктуальность Или ЗначениеЗаполнено(ИдентификаторЗаданияПроверкиАктуализации) Тогда
		
		СтатусФоновогоЗадания = НСтр("ru = 'Выполняется проверка данных...'");
		
	Иначе
		
		СтатусФоновогоЗадания = "";
		
	КонецЕсли;
	
	ТребуетсяПроверятьАктуальность = Ложь;
	
КонецФункции

&НаКлиенте
Функция ПериодАктуализации()
	
	ТекущийПериод = ОбщегоНазначенияКлиент.ДатаСеанса();
	Если КонецКвартала(ТекущийПериод) < КонецКвартала(ПериодСобытия) Тогда
		Возврат ТекущийПериод;
	Иначе
		Возврат ПериодСобытия;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
